---
kind: property
id: P:Autodesk.Revit.DB.ViewNode.ViewId
source: html/a4efcf3d-f109-1e84-2010-025bebcff6bb.htm
---
# Autodesk.Revit.DB.ViewNode.ViewId Property

The Id of the view element.

## Syntax (C#)
```csharp
public ElementId ViewId { get; }
```